<template>
  <section class="mt-10 max-w-3xl mx-auto text-left space-y-6">
    <div>
      <h1 class="text-2xl md:text-3xl lg:text-4xl">
        Публичная оферта на оказание услуг сервиса
      </h1>
      <p class="mt-2">
        в ред. от "31" июля 2024г.
      </p>
    </div>

    <div class="mt-6 space-y-3">
      <h2 class="text-xl">
        Термины
      </h2>
      <p>
        <b>Администрация</b> — Косарев Николай Николаевич ОГРНИП 319112100033557 от 06.12.2019 / ИНН 110111889708,
        зарегистрированный в соответствии с Федеральным законом, самостоятельно и в лице уполномоченных
        лиц осуществляющий администрирование Сайта и обеспечивающий использование Сервиса Пользователями.
        Администрации Сайта принадлежат все соответствующие исключительные имущественные права на Сайт,
        Контент, Сервис, а также права использования доменных и поддоменных имен Сайта.
      </p>
      <p>
        <b>Сайт</b> — это совокупность связанных между собой веб-страниц, размещенных в сети Интернет, имеющих
        доменное имя https://chatgame.space/ (включая поддомены). Сайт доступен для всех Пользователей сети Интернет.
      </p>
      <p>
        <b>Сервис</b> — программно-аппаратный комплекс «ChatGame», состоящий из Сайта, ПО, а также включающий аудио, видео,
        графические (изобразительные) материалы, тексты, названия, логотипы, средства индивидуализации
        (фирменное наименование, коммерческое обозначение, товарный знак), доменное имя (доменные имена) и иные
        объекты, которые могут быть признаны объектами интеллектуальной собственности, и расположенный в сети
        Интернет по адресу https://chatgame.space/ и поддоменах.
      </p>
      <p>
        <b>Игра</b> — интерактивная компьютерная онлайн-игра, являющаяся программой для ЭВМ и размещенная правообладателем
        Игры на Сервисе.
      </p>
      <p><b>Пользователь</b> — любое право- и дееспособное физическое лицо, осуществившее Акцепт настоящей Оферты и использующее Сервис.</p>
      <p>
        <b>Услуги</b> — предоставление Администрацией Пользователю доступа к Сервису, использованию его функциональных
        возможностей, обеспечению игрового процесса на условиях, определенных настоящей Офертой.
      </p>
      <p>
        <b>Дополнительные услуги</b> — предоставление Пользователю дополнительных, специальных возможностей Игры за плату
        на условиях, определенных настоящей Офертой. Дополнительные услуги не являются необходимым условием участия
        Пользователя в Игре и предоставляются Пользователю для получения им дополнительных возможностей Игры,
        выходящих за рамки Услуг. Дополнительные услуги предоставляются по запросу и желанию Пользователя.
        Дополнительные услуги состоят из Монет и игровых ценностей, которые могут быть предоставлены Пользователю.
      </p>
      <p>
        <b>Оферта</b> — публичное предложение Администрации, адресованное любому Пользователю, заключить с ним Договор
        на существующих условиях, содержащихся в Оферте, текст которой опубликован в сети Интернет на Сайте.
      </p>
      <p>
        <b>Договор</b> — договор предоставления услуг Сервиса между Администрацией и Пользователем, который заключается
        посредством акцепта Оферты.
      </p>
      <p>
        <b>Акцепт</b> — полное и безоговорочное принятие Пользователем условий настоящей Оферты. Акцептом настоящей Оферты
        является авторизованный вход Пользователя в Сервис или Игру.
      </p>
      <p>
        <b>Профиль</b> — учетная запись Пользователя на Сайте, которая содержит персональные данные Пользователя,
        а также иную информацию, связанную с использованием Сервиса.
      </p>
      <p><b>Монеты</b> — игровое платежное средство, которое приобретается Пользователем в Сервисе.</p>
      <p>
        <b>Контент</b> — любые размещенные на Сайте объекты интеллектуальной собственности Администрации в
        форме текстов, изображений, рисунков, фотографий, графиков, диаграмм, видео, программ, звуков,
        пользовательских интерфейсов, логотипов, торговых марок, компьютерных кодов, которые являются
        содержанием Сайта, Сервиса и/или размещены на Сайте и в Сервисе с согласия Администрации.
      </p>
    </div>

    <div class="space-y-3">
      <h2 class="text-xl">
        1. Общие положения
      </h2>
      <p>1.1. Условия Оферты действуют на Сайте.</p>
      <p>1.2. Пользователь обязан ознакомиться со следующей информацией:</p>
      <p>1.2.1. Оферта;</p>
      <p>1.2.2. информация, указанная на Сайте в отношении Монет;</p>
      <p>1.3. Администрация вправе вносить изменения в Оферту. Пользователь самостоятельно отслеживает такие изменения.</p>
      <p>
        1.4. Администрация и Пользователь гарантируют, что обладают право- и дееспособностью, а также всеми
        правами, необходимыми для заключения и исполнения Договора.
      </p>
      <p>1.5. Договор считается заключенным с момента производства Акцепта Пользователем.</p>
      <p>1.6. Предложение о заключении Договора действует бессрочно.</p>
    </div>

    <div class="space-y-3">
      <h2 class="text-xl">
        2. Предмет
      </h2>
      <p>
        2.1. Предметом настоящей оферты является предоставление Пользователям Услуг по обеспечению доступа к
        Сервису, его платному и бесплатному функционалу. В состав таких услуг входит следующее:
      </p>
      <p>2.1.1. Предоставление возможности использовать Сайт, включая его просмотр, регистрацию Профиля и использование Профиля;</p>
      <p>2.1.2. Предоставление доступа к участию в Игре, использованию ее возможностей и сервисов, обеспечению игрового процесса;</p>
      <p>2.1.3. Доступ к играм размещенным в Сервисе.</p>
      <p>2.1.4. Дополнительные услуги.</p>
      <p>
        2.2. Совершая акцепт Оферты, Пользователь уведомлен, что Сервис является комплексным электронным сервисом,
        который зависит от массы разных факторов, находящихся вне зоны контроля: работоспособность каналов связи,
        изменения в правилах и API используемых серверов, сервисов доставки уведомлений и прочего. Доступ к Сервису
        на протяжении 100% времени не гарантируется.
      </p>
      <p>
        2.3. Под действие настоящей Оферты подпадают все существующие (реально функционирующие) на данный момент
        функции Сайта / Сервиса, а также любые их последующие модификации и появляющиеся в дальнейшем дополнительные услуги.
      </p>
    </div>

    <div class="space-y-3">
      <h2 class="text-xl">
        3. Права и обязанности сторон
      </h2>
      <p>3.1. Обязанности Администрации:</p>
      <p>3.1.1. Предоставить Пользователю доступ к функционалу Сервиса на платной и бесплатной основе в соответствии с условиями настоящей Оферты.</p>
      <p>3.1.2. Осуществлять техническую поддержку Пользователя.</p>
      <p>
        3.1.3. Решать с помощью переписки спорные ситуации при обращении Пользователя в службу поддержки Сайта.
        Если какой-либо вопрос не регулируется настоящей Офертой Администрация принимает решение о том,
        как необходимо поступить в той или иной ситуации.
      </p>
      <p>
        3.1.4. Не разглашать Персональные данные Пользователей и не предоставлять доступ к этой информации
        третьим лицам за исключением случаев, прямо предусмотренных законодательством. Резервное копирование
        данных Пользователя в целях предотвращения потери информации не является нарушением конфиденциальности.
      </p>
      <p>
        3.1.5. Обеспечивать работу Сервиса, в соответствии с настоящей Офертой, круглосуточно 7 дней в неделю,
        включая выходные и праздничные дни (сервис должен быть доступен не менее 90% времени в месяц), за
        исключением случаев, оговоренных в настоящей Оферте.
      </p>

      <p>3.2. Администрация вправе:</p>
      <p>3.2.1. Самостоятельно определять способы и методы реализации Услуг без предварительного согласования с Пользователями.</p>
      <p>3.2.2. Управлять Игрой и игровыми процессами и менять их по своему усмотрению.</p>
      <p>3.2.3. В любое время приостанавливать либо изменять ход игрового процесса и условия Игры без предварительного уведомления Пользователя.</p>
      <p>
        3.2.4. В любое время изменять, дополнять, модифицировать Игру, любую из ее частей, включая клиентскую часть,
        без какого-либо предварительного уведомления Пользователя. Таким образом, Пользователь имеет возможность
        только участвовать в Игре в ее текущей версии.
      </p>
      <p>3.2.5. В одностороннем порядке изменять условия доступа к Сервису.</p>
      <p>3.2.6. Отказать Пользователю в предоставлении доступа к Сервису без объяснения причин.</p>
      <p>
        3.2.7. В любое время по своему собственному усмотрению изменять правила пользования Сайтом, а также
        изменять, обновлять содержание, функциональные возможности и интерфейс Сайта и Сервиса.
      </p>
      <p>
        3.2.8. Приостанавливать работу Сервиса для проведения необходимых плановых профилактических и ремонтных
        работ на Сервисе, а также внеплановых работ в аварийных ситуациях.
      </p>
      <p>
        3.2.9. С момента расторжения или прекращения срока действия Оферты Администрация имеет право удалить
        все данные Пользователя из Сервиса без возможности восстановления и освобождается от любых обязательств,
        связанных с данными Пользователя.
      </p>

      <p>3.3. Обязанности Пользователя:</p>
      <p>3.3.1. Использовать Сервис только для законных целей и законными способами с учетом законодательства РФ и международных норм.</p>
      <p>
        3.3.2. Не осуществлять запись, не распространять (не публиковать, не размещать на веб-сайтах, не копировать,
        не передавать или не перепродавать третьим лицам) в коммерческих или некоммерческих целях предоставляемую
        Администрацией информацию и материалы, не создавать на ее основе информационные продукты с целью извлечения
        коммерческой прибыли.
      </p>
      <p>
        3.3.3. При использовании Сервиса не допускать любых противоправных действий, в том числе тех, которые
        будут представлять собой уголовное преступление, приведут к административной или гражданской ответственности,
        могут каким-либо образом нанести ущерб Администрации или третьим лицам.
      </p>
      <p>
        3.3.4. Никаким образом не модифицировать код элементов Сайта и Сервиса и/или необходимых для функционирования
        Сайта и Сервиса и иным другим образом вмешиваться в работу Сайта/Сервиса с целью нарушения его нормального
        функционирования.
      </p>
      <p>
        3.3.5. Не создавать и использовать в Игре ботов (игровых персонажей, которые управляются с помощью программы),
        иные программы, какие-либо технические и/или иные средства для эмуляции действий Пользователя в Игре.
      </p>
      <p>
        3.3.6. Не использовать любые нецензурные, оскорбительные, провокационные или не предусмотренные Игрой
        слова и символы в любом виде в наименованиях или описаниях персонажей и других игровых объектов.
      </p>
      <p>
        3.3.7. Не использовать в игровом процессе ненормативной лексики, оскорблений, угрозы насилия или
        физической расправы, рекламы наркотиков, порнографических материалов или сторонних ресурсов, содержащих
        эти материалы в открытом доступе, пропаганды нетерпимости к расовой, национальной, религиозной, культурной,
        идеологической, половой, языковой или политической принадлежности, в т.ч. нацизма, фашизма, фанатизма,
        терроризма. Все указанное в этом пункте запрещено использовать Пользователям в игровом процессе, даже если
        это написано с пропущенными буквами и/или словами и/или заменой определенных слов/букв любыми знаками и/или
        транслитерацией, в т.ч. латинским алфавитом.
      </p>
      <p>
        3.3.8. Не размещать и не распространять любую информацию, которая может быть использована для взлома
        компьютерных систем или содержит в себе компьютерные вирусы или другие компоненты, приравненные к ним.
      </p>
      <p>3.3.9. Не влиять своими действиями на деловую репутацию Сервиса.</p>

      <p>3.4. Пользователь вправе:</p>
      <p>3.4.1. Приобретать Услуги при условии соблюдения действующего законодательства, условий настоящей Офертой.</p>
      <p>3.4.2. Использовать Сервис в соответствии с его назначением в личных целях.</p>
      <p>3.4.3. Приобретать игровую валюту (Монеты) на добровольной основе.</p>
      <p>3.4.4. Прекратить использование Сайта и Сервиса в любое время.</p>
      <p>
        3.4.5. В любой момент обратиться к Администрации для выяснения ситуации и принятия необходимых мер в
        случае возникновения в работе Сервиса проблем технического характера, а также в случае получения
        Пользователем сообщений, являющихся несанкционированной рекламной рассылкой, либо содержащих угрозы или
        файлы с подозрением на вирус, а также если Пользователь обнаруживает факты, дающие основания полагать, что
        его доступ к Сайту был использован кем-либо несанкционированно.
      </p>
    </div>

    <div class="space-y-3">
      <h2 class="text-xl">
        4. Покупка Монет
      </h2>
      <p>
        4.1. Любой Пользователь имеет возможность повлиять на развитие Игры путем приобретения на Сайте
        внутриигровой валюты — Монет.
      </p>
      <p>
        4.2. Покупка Монет осуществляется путем перечисления денежных средств на расчетный счет Администрации
        посредством формы для оплаты на Сайте.
      </p>
      <p>
        4.3. После приобретения Монет Пользователем Администрация обязуется зачислить на Профиль Пользователя
        внутриигровую валюту или иной игровой ресурс в соответствии с выбранной пользователем услугой на Сервисе.
      </p>
      <p>4.4. Администрация оставляет за собой право в любой момент изменять стоимость Монет.</p>
      <p>
        4.5. Пользователь самостоятельно несет ответственность за ошибки, которые допущены им при оплате.
        Администрация не несет ответственности за убытки и иные неблагоприятные последствия, которые могут
        возникнуть у Пользователя и/или третьих лиц в случае неправильного указания назначения платежа.
      </p>
      <p>
        4.6. Пользователь осознает и понимает, что цели Монет предполагают использование для поддержания,
        развития Игры и Сервиса в целом. Монеты являются невозвратными.
      </p>
      <p>
        4.7. Администрация оставляет за собой право начислять, по своему усмотрению, персональные внутриигровые
        бонусы для Пользователей, которые приобрели Монеты.
      </p>
    </div>

    <div class="space-y-3">
      <h2 class="text-xl">
        5. Функционал Сервиса
      </h2>
      <p>
        5.1. Для того чтобы получить доступ к Сервису Пользователь должен авторизоваться, для чего Пользователь
        самостоятельно путем указания своих персональных данных проходит процедуру регистрации, в результате
        которой для Пользователя создается Профиль.
      </p>
      <p>5.2. Для использования Сервиса Пользователь самостоятельно заходит на Сайт.</p>
      <p>
        5.3. Пользователь, предоставляя какие-либо персональные данные в Сервисе (в том числе и для оплаты Монет),
        соглашается с тем, что вся эта информация является точной, достоверной, актуальной и полной и подтверждает
        свое согласие на обработку Администрацией своих персональных данных. Администрация обязуется не сообщать
        персональные данные Пользователя, а также иную информацию, касающуюся личных данных Пользователя, лицам,
        не имеющим отношения к исполнению настоящего Соглашения.
      </p>
      <p>
        5.4. При доступе Пользователя к Сервису может применяться технология cookies в целях автоматической
        авторизации Пользователя на Сайте, а также для сбора статистических данных, в частности о посещаемости Сайта.
        Пользователь вправе ограничить или запретить использование технологии cookies путем применения
        соответствующих настроек браузера.
      </p>
      <p>
        5.5. Любые действия, совершенные с использованием данных Пользователя, считаются совершенными
        соответствующим Пользователем. Пользователь самостоятельно обеспечивает конфиденциальность своих данных.
        Пользователь самостоятельно несет ответственность за все действия (а также их последствия) в рамках или с
        использованием Сервиса, включая случаи добровольной передачи Пользователем данных для доступа к Профилю
        Пользователя третьим лицам на любых условиях (в том числе по договорам или соглашениям).
      </p>
      <p>5.6. Одновременно Пользователь может иметь только один Профиль.</p>
      <p>
        5.7. Пользователям запрещены любые действия, направленные на получение несанкционированного доступа к
        ресурсам Сервиса, персональным, учетным и иным данным других Пользователей.
      </p>
      <p>5.8. При оказании услуг акт об оказанных услугах не формируется и не подписывается.</p>
    </div>

    <div class="space-y-3">
      <h2 class="text-xl">
        6. Контент. Интеллектуальная собственность
      </h2>
      <p>
        6.1. Сайт и Сервис являются интеллектуальной собственностью Администрации, правовая охрана которой
        устанавливается Гражданским Кодексом Российской Федерации, международными договорами Российской Федерации.
        Администрация гарантирует наличие у нее прав, необходимых для исполнения настоящего Договора, при этом
        Администрация информирует Пользователя, что согласно ст. 1262 Гражданского кодекса Российской Федерации
        государственная регистрация прав в отношении баз данных осуществляется по желанию Администрации.
      </p>
      <p>
        6.2. Использование Контента Сайта/Сервиса для любых целей, прямо не разрешенных настоящей Офертой строго
        запрещено. Такие материалы нельзя копировать, воспроизводить, распространять, передавать, транслировать,
        демонстрировать, продавать, лицензировать или иным образом использовать для любых целей без согласия Администрации.
      </p>
      <p>
        6.3. Контент может содержать ссылки на другие сайты в сети Интернет. Такие сайты и их контент не
        проверяются Администрацией на соответствие тем или иным требованиям (достоверности, полноты, законности и т.п.).
        Администрация не несет ответственность за любую информацию, материалы, размещенные на сайтах третьих лиц,
        к которым Пользователь получает доступ с использованием Сервиса.
      </p>
    </div>

    <div class="space-y-3">
      <h2 class="text-xl">
        7. Ответственность
      </h2>
      <p>7.1. Ответственность Администрации ограничивается обеспечением функционирования Сервиса.</p>
      <p>
        7.2. Администрация не несет ответственности и не возмещает никакие косвенные/непрямые убытки, включая
        упущенную выгоду, причиненные Пользователям в результате использования или невозможности использования
        Сервиса, его отдельных компонентов и/или функций.
      </p>
      <p>
        7.3. Администрация не несет ответственности за высказывания Пользователя, произведенные или опубликованные
        на Сервисе. Администрация не несет ответственности за поведение Пользователя в Игре, включая поведение,
        характер и идеологию игровых персонажей, управляемых Пользователем, поступки игровых персонажей в Игре,
        неуважительное отношение к другим Пользователям.
      </p>
      <p>7.4. Администрация не несет ответственности за утерю Пользователем возможности доступа к своему Профилю.</p>
      <p>
        7.5. Администрация не несет ответственности за утрату Пользователем игровых ценностей, полученных в
        результате предоставления Дополнительных услуг.
      </p>
      <p>
        7.6. Пользователь несет полную ответственность за действия и/или бездействие, приведшие к разглашению,
        потере, краже и т.п. его персональных данных и иной информации, индивидуализирующей Пользователя, а также
        за любые действия и/или бездействия третьих лиц, использующих персональные данные Пользователя. Администрация
        не несет ответственности за вышеуказанные действия Пользователя и/или третьих лиц, использующих его
        персональные данные.
      </p>
      <p>
        7.7. Администрация не несет ответственности за возможные сбои и перерывы в работе Сервиса и вызванные ими
        потерю информации. Администрация не несет ответственности за любой ущерб компьютеру Пользователя, мобильным
        устройствам, любому другому оборудованию или программному обеспечению, вызванный или связанный с
        использованием Сервиса или сайтов, доступных по гиперссылкам, размещенным на сайте Сервиса.
      </p>
      <p>
        7.8. Администрация не несет ответственности и не компенсирует убытки Пользователя в случае, если
        Пользователь не может воспользоваться Сервисом по следующим причинам - технологические неисправности каналов
        связи общего пользования, посредством которых осуществляется доступ к Сервису, утраты пользователем доступа
        в интернет по любой причине, ошибки, пропуски, перерывы в работе или передаче данных, дефекты линий связи и
        иные технические сбои.
      </p>
      <p>
        7.9. Администрация не несет ответственности за несоответствие Услуг необоснованным ожиданиям Пользователей
        и их субъективной оценке. Ни при каких обстоятельствах Администрация не несет ответственность перед
        Пользователями и/или третьими лицами за любой косвенный, случайный, неумышленный ущерб, включая упущенную
        выгоду или потерянные данные, вред чести, достоинству или деловой репутации, вызванный в связи с
        использованием Сервиса.
      </p>
      <p>
        7.10. При любых обстоятельствах ответственность Администрация в соответствии со статьей 15 Гражданского
        кодекса России ограничена размером денежных средств, уплаченных Пользователем за Дополнительные услуги.
      </p>
      <p>
        7.11. Стороны освобождаются от ответственности за частичное или полное неисполнение обязательств вследствие
        обстоятельств непреодолимой силы. Под обстоятельствами непреодолимой силы понимаются: цунами, шторм,
        землетрясение, наводнения, природные пожары, тайфун, ураганы, засуха, изменение санитарно-эпидемиологической
        обстановки, катастрофы, массовые выступления, решения государственных органов, а также иные обстоятельства,
        возникшие в результате событий чрезвычайного характера.
      </p>
    </div>

    <div class="space-y-3">
      <h2 class="text-xl">
        8. Иные положения
      </h2>
      <p>
        8.1. Все разногласия, возникшие при исполнении Договора, заключенного в результате Акцепта Оферты,
        Стороны разрешают путем переговоров. Претензионный порядок обязателен. Срок ответа на претензию - 20 календарных дней.
      </p>
      <p>
        8.2. В той мере, в которой это разрешено обязательным местным законодательством (по защите прав потребителей),
        любой спор будет передаваться на рассмотрение исключительно в компетентные суды по месту нахождения
        Администрации.
      </p>
      <p>
        8.3. Стороны признают, что все уведомления, сообщения, соглашения, документы и письма, направленные с
        использованием уполномоченных адресов электронной почты, могут быть использованы в качестве письменных
        доказательств в суде.
      </p>
    </div>

    <div class="space-y-3">
      <h2 class="text-xl">
        9. Реквизиты
      </h2>
      <p>ИП Косарев Николай Николаевич ОГРНИП 319112100033557 от 06.12.2019 / ИНН 110111889708</p>
      <p>E-mail: hmbanan666@hotmail.com</p>
    </div>
  </section>
</template>
